const assert = require('assert');

const { all, 급여구간 } = require('../server/dev/sod');
describe('급여구간 정확성 검증', () => {
  it('1993000', () => {
    assert.equal(급여구간(1993000), 1995000);
  });
  it('2000000', () => {
    assert.equal(급여구간(2000000), 2005000);
  });
  it('2003000', () => {
    assert.equal(급여구간(2003000), 2005000);
  });
  it('2005000', () => {
    assert.equal(급여구간(2005000), 2005000);
  });
  it('2007000', () => {
    assert.equal(급여구간(2007000), 2005000);
  });
  it('2010000', () => {
    assert.equal(급여구간(2010000), 2015000);
  });
});

describe('소득세 계산 공식 계산', () => {
  describe('1055000~1060000', () => {
    it('1인', () => {
      assert.equal(all(1059000, 1, 0), 0);
    });
    it('2인', () => {
      assert.equal(all(1055000, 2, 0), 0);
    });
  });
  describe('1060000~1065000', () => {
    it('1인', () => {
      assert.equal(all(1061000, 1, 0), 1040);
    });
    it('2인', () => {
      assert.equal(all(1061000, 2, 0), 0);
    });
  });
  describe('1500000~1510000', () => {
    it('1인', () => {
      assert.equal(all(1500000, 1, 0), 8920);
    });
    it('2인', () => {
      assert.equal(all(1505000, 2, 0), 4420);
    });
  });
  describe('200만원대', () => {
    it('2005000-1', () => {
      assert.equal(all(2005000, 1, 0), 19520);
    });
    it('2005000-2', () => {
      assert.equal(all(2005000, 2, 0), 14750);
    });
    it('2005000-3', () => {
      assert.equal(all(2005000, 3, 0), 6600);
    });
    it('2005000-4', () => {
      assert.equal(all(2005000, 4, 0), 3220);
    });
    it('2005000-5', () => {
      assert.equal(all(2005000, 5, 0), 0);
    });

    it('2015000-1', () => {
      assert.equal(all(2015000, 1, 0), 19850);
    });
    it('2015000-2', () => {
      assert.equal(all(2015000, 2, 0), 14950);
    });
    it('2015000-3', () => {
      assert.equal(all(2015000, 3, 0), 6800);
    });
    it('2015000-4', () => {
      assert.equal(all(2015000, 4, 0), 3420);
    });
    it('2015000-5', () => {
      assert.equal(all(2015000, 5, 0), 0);
    });

    it('2025000-1', () => {
      assert.equal(all(2025000, 1, 0), 20170);
    });
    it('2025000-2', () => {
      assert.equal(all(2025000, 2, 0), 15160);
    });
    it('2025000-3', () => {
      assert.equal(all(2025000, 3, 0), 6990);
    });
    it('2025000-4', () => {
      assert.equal(all(2025000, 4, 0), 3620);
    });
    it('2025000-5', () => {
      assert.equal(all(2025000, 5, 0), 0);
    });

    it('2035000', () => {
      assert.equal(all(2035000, 1, 0), 20490);
    });
    it('2045000', () => {
      assert.equal(all(2045000, 1, 0), 20810);
    });

    it('2055000-1', () => {
      assert.equal(all(2055000, 1, 0), 21130);
    });
    it('2055000-2', () => {
      assert.equal(all(2055000, 2, 0), 15780);
    });
    it('2055000-3', () => {
      assert.equal(all(2055000, 3, 0), 7590);
    });
    it('2055000-4', () => {
      assert.equal(all(2055000, 4, 0), 4210);
    });
    it('2055000-5', () => {
      assert.equal(all(2055000, 5, 0), 0);
    });

    it('2065000-1', () => {
      assert.equal(all(2065000, 1, 0), 21450);
    });
    it('2065000-2', () => {
      assert.equal(all(2065000, 2, 0), 15990);
    });
    it('2065000-3', () => {
      assert.equal(all(2065000, 3, 0), 7790);
    });
    it('2065000-4', () => {
      assert.equal(all(2065000, 4, 0), 4410);
    });
    it('2065000-5', () => {
      assert.equal(all(2065000, 5, 0), 1040);
    });
    it('2065000-6', () => {
      assert.equal(all(2065000, 6, 0), 0);
    });
  });
  describe('3000000~3020000', () => {
    it('1인', () => {
      assert.equal(all(3010000, 1, 0), 84850);
    });
    it('2인', () => {
      assert.equal(all(3010000, 2, 0), 67350);
    });
    it('3인', () => {
      assert.equal(all(3010000, 3, 0), 32490);
    });
    it('4인', () => {
      assert.equal(all(3010000, 4, 0), 26690);
    });
    it('5인', () => {
      assert.equal(all(3010000, 5, 0), 21440);
    });
    it('6인', () => {
      assert.equal(all(3010000, 6, 0), 17100);
    });
    it('7인', () => {
      assert.equal(all(3010000, 7, 0), 13730);
    });
    it('8인', () => {
      assert.equal(all(3010000, 8, 0), 10350);
    });
    it('9인', () => {
      assert.equal(all(3010000, 9, 0), 6980);
    });
    it('10인', () => {
      assert.equal(all(3010000, 10, 0), 3600);
    });
    it('11인', () => {
      assert.equal(all(3010000, 11, 0), 0);
    });
  });
  describe('3020000~3040000', () => {
    it('1인', () => {
      assert.equal(all(3020000, 1, 0), 86560);
    });
    it('2인', () => {
      assert.equal(all(3020000, 2, 0), 69060);
    });
    it('3인', () => {
      assert.equal(all(3020000, 3, 0), 34140);
    });
    it('4인', () => {
      assert.equal(all(3039000, 4, 0), 27350);
    });
    it('5인', () => {
      assert.equal(all(3039000, 5, 0), 22100);
    });
    it('6인', () => {
      assert.equal(all(3039000, 6, 0), 17530);
    });
    it('7인', () => {
      assert.equal(all(3030000, 7, 0), 14150);
    });
    it('8인', () => {
      assert.equal(all(3030000, 8, 0), 10780);
    });
    it('9인', () => {
      assert.equal(all(3030000, 9, 0), 7400);
    });
    it('10인', () => {
      assert.equal(all(3030000, 10, 0), 4030);
    });
    it('11인', () => {
      assert.equal(all(3030000, 11, 0), 0);
    });
  });
  describe('4000000~4200000', () => {
    it('1인', () => {
      assert.equal(all(4010000, 1, 0), 210960);
    });
    it('2인', () => {
      assert.equal(all(4010000, 2, 0), 182950);
    });
    it('3인', () => {
      assert.equal(all(4010000, 3, 0), 124590);
    });
    it('4인', () => {
      assert.equal(all(4010000, 4, 0), 105840);
    });
    it('5인', () => {
      assert.equal(all(4010000, 5, 0), 89050);
    });
    it('6인', () => {
      assert.equal(all(4010000, 6, 0), 75920);
    });
    it('7인', () => {
      assert.equal(all(4010000, 7, 0), 62800);
    });
    it('8인', () => {
      assert.equal(all(4010000, 8, 0), 49670);
    });
    it('9인', () => {
      assert.equal(all(4010000, 9, 0), 36550);
    });
    it('10인', () => {
      assert.equal(all(4010000, 10, 0), 28320);
    });
    it('11인', () => {
      assert.equal(all(4010000, 11, 0), 23070);
    });
  });


  describe('5000000~5200000', () => {
    it('1인', () => {
      assert.equal(all(5000000, 1, 0), 350470);
    });
    it('2인', () => {
      assert.equal(all(5000000, 2, 0), 321710);
    });
    it('3인', () => {
      assert.equal(all(5010000, 3, 0), 252850);
    });
    it('4인', () => {
      assert.equal(all(5015000, 4, 0), 234100);
    });
    it('5인', () => {
      assert.equal(all(5019000, 5, 0), 215350);
    });
    it('6인', () => {
      assert.equal(all(5001000, 6, 0), 196600);
    });
    it('7인', () => {
      assert.equal(all(5010000, 7, 0), 177850);
    });
    it('8인', () => {
      assert.equal(all(5010000, 8, 0), 159100);
    });
    it('9인', () => {
      assert.equal(all(5010000, 9, 0), 140350);
    });
    it('10인', () => {
      assert.equal(all(5010000, 10, 0), 121600);
    });
    it('11인', () => {
      assert.equal(all(5010000, 11, 0), 102850);
    });
  });
})
